# 1. Базовый образ с Python
FROM python:3.9-slim

# 2. Установка рабочей директории внутри контейнера
WORKDIR /app

# ---- ВОТ РЕШЕНИЕ ----
# Устанавливаем переменную окружения, чтобы кэш Hugging Face
# сохранялся в локальную папку /app/cache, а не в системный корень.
ENV HF_HOME /app/cache
# --------------------

# 3. Копируем сначала файл с зависимостями
COPY requirements.txt .

# 4. Устанавливаем зависимости
RUN pip install --no-cache-dir -r requirements.txt

# 5. Копируем остальной код приложения
COPY . .

# 6. Указываем порт, который будет "слушать" наше приложение
EXPOSE 8000

# 7. Команда для запуска приложения при старте контейнера
CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "8000"]